In [1]:
import sqlite3 as sql

In [2]:
connection = sql.connect('demo.db')

In [4]:
cursor = connection.cursor()
cursor.execute('''CREATE TABLE deepu (id integer primary key, name text not null, age integer)''')

In [5]:
connection.commit()

In [12]:

cursor.execute("INSERT INTO deepu (id, name, age) VALUES (2, 'Deepanshi', 22)")
#connection.execute("")

In [15]:
cursor.execute("SELECT * FROM deepu")
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Deepanshi', 22)
(2, 'Deepanshi', 22)

In [17]:
import pandas as pd
df = pd.DataFrame (results)
df

   0          1   2
0  1  Deepanshi  22
1  2  Deepanshi  22

In [18]:
cursor = connection.cursor()
cursor.execute('''CREATE TABLE vaanu (id integer primary key, name text not null, age integer, city text, state text, phone integer )''')

In [19]:
cursor.execute("INSERT INTO vaanu (id, name, age, city, state, phone) VALUES (1, 'Vaanu', 23, 'Delhi', 'Delhi', 9876543210), (2, 'Aman', 24, 'Mumbai', 'Maharashtra', 8765432109), (3, 'Riya', 22, 'Bangalore', 'Karnataka', 7654321098), (4, 'Karan', 25, 'Chennai', 'Tamil Nadu', 6543210987), (5, 'Sneha', 21, 'Kolkata', 'West Bengal', 5432109876),(6, 'Anjali', 23, 'Hyderabad', 'Telangana', 4321098765), (7, 'Rahul', 24, 'Pune', 'Maharashtra', 3210987654), (8, 'Priya', 22, 'Ahmedabad', 'Gujarat', 2109876543), (9, 'Aakash', 25, 'Jaipur', 'Rajasthan', 1098765432), (10, 'Neha', 21, 'Lucknow', 'Uttar Pradesh', 9876543210)")
#connection.execute("")

In [21]:

cursor.execute("SELECT * FROM vaanu")
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Vaanu', 23, 'Delhi', 'Delhi', 9876543210)
(2, 'Aman', 24, 'Mumbai', 'Maharashtra', 8765432109)
(3, 'Riya', 22, 'Bangalore', 'Karnataka', 7654321098)
(4, 'Karan', 25, 'Chennai', 'Tamil Nadu', 6543210987)
(5, 'Sneha', 21, 'Kolkata', 'West Bengal', 5432109876)
(6, 'Anjali', 23, 'Hyderabad', 'Telangana', 4321098765)
(7, 'Rahul', 24, 'Pune', 'Maharashtra', 3210987654)
(8, 'Priya', 22, 'Ahmedabad', 'Gujarat', 2109876543)
(9, 'Aakash', 25, 'Jaipur', 'Rajasthan', 1098765432)
(10, 'Neha', 21, 'Lucknow', 'Uttar Pradesh', 9876543210)